posts/2015-01-13-holy-week.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Holy Week

What is it like\\
to burn,\\
but never burn up;\\
to endure the pain\\
of the flame,\\
but never know\\
the relief of destruction?\\
\\
With no hope for the future,\\
and no memory of their past,\\
your people endured\\
the burden of slavery;\\
people who burn,\\
but never burn up.\\
\\
Then Moses heard a voice,\\
saying,\\
\\
"I see their misery;\\
I hear their cries;\\
indeed, I know their sufferings.\\
Take off your shoes,\\
for you stand on holy ground."\\
\\
Father, we confess\\
that we are not like you.\\
We see the suffering,\\
we hear the cries,\\
yet we do not feel the pain.\\
\\
Open our eyes this week\\
to the suffering\\
of your world,\\
and open our ears to the\\
voice that cries from the cross,\\
\\
May we remove our shoes,\\
for we stand with those who suffer,\\
in the shadow of the God who suffers with them.\\
\\

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]]
#+end_tagline
