docs/posts/2015-01-13-holy-week.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holy Week</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Holy Week</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
What is it like<br>
to burn,<br>
but never burn up;<br>
to endure the pain<br>
of the flame,<br>
but never know<br>
the relief of destruction?<br>
<br>
With no hope for the future,<br>
and no memory of their past,<br>
your people endured<br>
the burden of slavery;<br>
people who burn,<br>
but never burn up.<br>
<br>
Then Moses heard a voice,<br>
saying,<br>
<br>
&ldquo;I see their misery;<br>
I hear their cries;<br>
indeed, I know their sufferings.<br>
Take off your shoes,<br>
for you stand on holy ground.&rdquo;<br>
<br>
Father, we confess<br>
that we are not like you.<br>
We see the suffering,<br>
we hear the cries,<br>
yet we do not feel the pain.<br>
<br>
Open our eyes this week<br>
to the suffering<br>
of your world,<br>
and open our ears to the<br>
voice that cries from the cross,<br>
<br>
May we remove our shoes,<br>
for we stand with those who suffer,<br>
in the shadow of the God who suffers with them.<br>
<br>
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
